package com.zhijia.ui.calculator;

/**
 * 银行汇率
 */
public class HouseBankRate {

    public static final double[][][] RATE = new double[32][][];

    static {
        //08年12月23日利率下限(7折)
        RATE[1] = new double[3][];
        RATE[1][1] = new double[11];
        RATE[1][2] = new double[11];
        RATE[1][1][5] = 0.0403;//商贷 1～5年 4.03%
        RATE[1][1][10] = 0.0416;//商贷 5-30年 4.16%
        RATE[1][2][5] = 0.0333;//公积金 1～5年 3.33%
        RATE[1][2][10] = 0.0387;//公积金 5-30年 3.87%
        //08年12月23日利率下限(85折)
        RATE[2] = new double[3][];
        RATE[2][1] = new double[11];
        RATE[2][2] = new double[11];
        RATE[2][1][5] = 0.049;//商贷 1～5年 4.9%
        RATE[2][1][10] = 0.0505;//商贷 5-30年 5.05%
        RATE[2][2][5] = 0.0333;//公积金 1～5年 3.33%
        RATE[2][2][10] = 0.0387;//公积金 5-30年 3.87%
        //08年12月23日基准利率
        RATE[3] = new double[3][];
        RATE[3][1] = new double[11];
        RATE[3][2] = new double[11];
        RATE[3][1][5] = 0.0576;//商贷 1～5年 5.76%
        RATE[3][1][10] = 0.0594;//商贷 5-30年 5.94%
        RATE[3][2][5] = 0.0333;//公积金 1～5年 3.33%
        RATE[3][2][10] = 0.0387;//公积金 5-30年 3.87%
        //08年12月23日利率上限(1.1倍)
        RATE[4] = new double[3][];
        RATE[4][1] = new double[11];
        RATE[4][2] = new double[11];
        RATE[4][1][5] = 0.0634;//商贷 1～5年 6.34%
        RATE[4][1][10] = 0.0653;//商贷 5-30年 6.53%
        RATE[4][2][5] = 0.0333;//公积金 1～5年 3.33%
        RATE[4][2][10] = 0.0387;//公积金 5-30年 3.87%
        //10年10月20日利率下限(7折)
        RATE[5] = new double[3][];
        RATE[5][1] = new double[11];
        RATE[5][2] = new double[11];
        RATE[5][1][5] = 0.04172;//商贷 1～5年 4.172%
        RATE[5][1][10] = 0.04298;//商贷 5-30年 4.298%
        RATE[5][2][5] = 0.035;//公积金 1～5年 3.5%
        RATE[5][2][10] = 0.0405;//公积金 5-30年 4.05%
        //10年10月20日利率下限(85折)
        RATE[6] = new double[3][];
        RATE[6][1] = new double[11];
        RATE[6][2] = new double[11];
        RATE[6][1][5] = 0.05066;//商贷 1～5年 5.066%
        RATE[6][1][10] = 0.05218;//商贷 5-30年 5.218%
        RATE[6][2][5] = 0.035;//公积金 1～5年 3.5%
        RATE[6][2][10] = 0.0405;//公积金 5-30年 4.05%
        //10年10月20日基准利率
        RATE[7] = new double[3][];
        RATE[7][1] = new double[11];
        RATE[7][2] = new double[11];
        RATE[7][1][5] = 0.0596;//商贷 1～5年 5.96%
        RATE[7][1][10] = 0.0614;//商贷 5-30年 6.14%
        RATE[7][2][5] = 0.035;//公积金 1～5年 3.5%
        RATE[7][2][10] = 0.0405;//公积金 5-30年 4.05%
        //10年10月20日利率上限(1.1倍)
        RATE[8] = new double[3][];
        RATE[8][1] = new double[11];
        RATE[8][2] = new double[11];
        RATE[8][1][5] = 0.06556;//商贷 1～5年 6.556%
        RATE[8][1][10] = 0.06754;//商贷 5-30年 6.754%
        RATE[8][2][5] = 0.035;//公积金 1～5年 3.5%
        RATE[8][2][10] = 0.0405;//公积金 5-30年 4.05%
        //10年12月26日基准利率
        RATE[9] = new double[3][];
        RATE[9][1] = new double[11];
        RATE[9][2] = new double[11];
        RATE[9][1][5] = 0.0622;//商贷 1～5年 6.22%
        RATE[9][1][10] = 0.0640;//商贷 5-30年 6.4%
        RATE[9][2][5] = 0.0375;//公积金 1～5年 3.75%
        RATE[9][2][10] = 0.0430;//公积金 5-30年 4.3%
        //10年12月26日利率下限(7折)
        RATE[10] = new double[3][];
        RATE[10][1] = new double[11];
        RATE[10][2] = new double[11];
        RATE[10][1][5] = 0.04354;//商贷 1～5年 4.354%
        RATE[10][1][10] = 0.0448;//商贷 5-30年 4.48%
        RATE[10][2][5] = 0.0375;//公积金 1～5年 3.75%
        RATE[10][2][10] = 0.0430;//公积金 5-30年 4.3%
        //10年12月26日利率上限(1.1倍)
        RATE[11] = new double[3][];
        RATE[11][1] = new double[11];
        RATE[11][2] = new double[11];
        RATE[11][1][5] = 0.06842;//商贷 1～5年 6.842%
        RATE[11][1][10] = 0.0704;//商贷 5-30年 7.04%
        RATE[11][2][5] = 0.0375;//公积金 1～5年 3.75%
        RATE[11][2][10] = 0.0430;//公积金 5-30年 4.3%
        //11年2月9日基准利率
        RATE[12] = new double[3][];
        RATE[12][1] = new double[11];
        RATE[12][2] = new double[11];
        RATE[12][1][5] = 0.0645;//商贷 1～5年 6.45%
        RATE[12][1][10] = 0.0660;//商贷 5-30年 6.6%
        RATE[12][2][5] = 0.0400;//公积金 1～5年 4%
        RATE[12][2][10] = 0.0450;//公积金 5-30年 4.5%
        //11年2月9日利率下限(7折)
        RATE[13] = new double[3][];
        RATE[13][1] = new double[11];
        RATE[13][2] = new double[11];
        RATE[13][1][5] = 0.04515;//商贷 1～5年 4.515%
        RATE[13][1][10] = 0.04620;//商贷 5-30年 4.62%
        RATE[13][2][5] = 0.0400;//公积金 1～5年 4%
        RATE[13][2][10] = 0.0450;//公积金 5-30年 4.5%
        //11年2月9日利率下限(85折)
        RATE[14] = new double[3][];
        RATE[14][1] = new double[11];
        RATE[14][2] = new double[11];
        RATE[14][1][5] = 0.054825;//商贷 1～5年 5.4825%
        RATE[14][1][10] = 0.0561;//商贷 5-30年 5.61%
        RATE[14][2][5] = 0.0400;//公积金 1～5年 4%
        RATE[14][2][10] = 0.0450;//公积金 5-30年 4.5%
        //11年2月9日利率上限(1.1倍)
        RATE[15] = new double[3][];
        RATE[15][1] = new double[11];
        RATE[15][2] = new double[11];
        RATE[15][1][5] = 0.07095;//商贷 1～5年 7.095%
        RATE[15][1][10] = 0.0726;//商贷 5-30年 7.26%
        RATE[15][2][5] = 0.0400;//公积金 1～5年 4%
        RATE[15][2][10] = 0.0450;//公积金 5-30年 4.5%
        //11年4月5日基准利率
        RATE[16] = new double[3][];
        RATE[16][1] = new double[11];
        RATE[16][2] = new double[11];
        RATE[16][1][5] = 0.0665;//商贷 1～5年 6.65%
        RATE[16][1][10] = 0.0680;//商贷 5-30年 6.8%
        RATE[16][2][5] = 0.0420;//公积金 1～5年 4.2%
        RATE[16][2][10] = 0.0470;//公积金 5-30年 4.7%
        //11年4月5日利率下限（7折）
        RATE[17] = new double[3][];
        RATE[17][1] = new double[11];
        RATE[17][2] = new double[11];
        RATE[17][1][5] = 0.04655;//商贷 1～5年 4.655%
        RATE[17][1][10] = 0.0476;//商贷 5-30年 4.76%
        RATE[17][2][5] = 0.0420;//公积金 1～5年 4.2%
        RATE[17][2][10] = 0.0470;//公积金 5-30年 4.7%
        //11年4月5日利率下限（85折）
        RATE[18] = new double[3][];
        RATE[18][1] = new double[11];
        RATE[18][2] = new double[11];
        RATE[18][1][5] = 0.056525;//商贷 1～5年 5.6525%
        RATE[18][1][10] = 0.0578;//商贷 5-30年 5.78%
        RATE[18][2][5] = 0.0420;//公积金 1～5年 4.2%
        RATE[18][2][10] = 0.0470;//公积金 5-30年 4.7%
        //11年4月5日利率上限（1.1倍）
        RATE[19] = new double[3][];
        RATE[19][1] = new double[11];
        RATE[19][2] = new double[11];
        RATE[19][1][5] = 0.07315;//商贷 1～5年 7.315%
        RATE[19][1][10] = 0.0748;//商贷 5-30年 7.48%
        RATE[19][2][5] = 0.0420;//公积金 1～5年 4.2%
        RATE[19][2][10] = 0.0470;//公积金 5-30年 4.7%
        //11年7月6日基准利率
        RATE[20] = new double[3][];
        RATE[20][1] = new double[11];
        RATE[20][2] = new double[11];
        RATE[20][1][5] = 0.0690;//商贷 1～5年 6.9%
        RATE[20][1][10] = 0.0705;//商贷 5-30年 7.05%
        RATE[20][2][5] = 0.0445;//公积金 1～5年 4.45%
        RATE[20][2][10] = 0.0490;//公积金 5-30年 4.9%
        //11年7月6日利率下限（7折）
        RATE[21] = new double[3][];
        RATE[21][1] = new double[11];
        RATE[21][2] = new double[11];
        RATE[21][1][5] = 0.0483;//商贷 1～5年 4.83%
        RATE[21][1][10] = 0.04935;//商贷 5-30年 4.935%
        RATE[21][2][5] = 0.0445;//公积金 1～5年 4.45%
        RATE[21][2][10] = 0.0490;//公积金 5-30年 4.9%
        //11年7月6日利率下限（85折）
        RATE[22] = new double[3][];
        RATE[22][1] = new double[11];
        RATE[22][2] = new double[11];
        RATE[22][1][5] = 0.05865;//商贷 1～5年 5.865%
        RATE[22][1][10] = 0.059925;//商贷 5-30年 5.9925%
        RATE[22][2][5] = 0.0445;//公积金 1～5年 4.45%
        RATE[22][2][10] = 0.0490;//公积金 5-30年 4.9%
        //11年7月6日利率上限（1.1倍）
        RATE[23] = new double[3][];
        RATE[23][1] = new double[11];
        RATE[23][2] = new double[11];
        RATE[23][1][5] = 0.0759;//商贷 1～5年 7.59%
        RATE[23][1][10] = 0.07755;//商贷 5-30年 7.755%
        RATE[23][2][5] = 0.0445;//公积金 1～5年 4.45%
        RATE[23][2][10] = 0.0490;//公积金 5-30年 4.9%
        //12年6月8日基准利率
        RATE[24] = new double[3][];
        RATE[24][1] = new double[11];
        RATE[24][2] = new double[11];
        RATE[24][1][5] = 0.0665;//商贷 1～5年 6.65%
        RATE[24][1][10] = 0.0680;//商贷 5-30年 6.8%
        RATE[24][2][5] = 0.0420;//公积金 1～5年 4.2%
        RATE[24][2][10] = 0.0470;//公积金 5-30年 4.7%
        //12年6月8日利率下限（7折）
        RATE[25] = new double[3][];
        RATE[25][1] = new double[11];
        RATE[25][2] = new double[11];
        RATE[25][1][5] = 0.04655;//商贷 1～5年 4.655%
        RATE[25][1][10] = 0.0476;//商贷 5-30年 4.76%
        RATE[25][2][5] = 0.0420;//公积金 1～5年 4.2%
        RATE[25][2][10] = 0.0470;//公积金 5-30年 4.7%
        //12年6月8日利率下限（85折）
        RATE[26] = new double[3][];
        RATE[26][1] = new double[11];
        RATE[26][2] = new double[11];
        RATE[26][1][5] = 0.056525;//商贷 1～5年 5.6525%
        RATE[26][1][10] = 0.0578;//商贷 5-30年 5.78%
        RATE[26][2][5] = 0.0420;//公积金 1～5年 4.2%
        RATE[26][2][10] = 0.0470;//公积金 5-30年 4.7%
        //12年6月8日利率上限（1.1倍）
        RATE[27] = new double[3][];
        RATE[27][1] = new double[11];
        RATE[27][2] = new double[11];
        RATE[27][1][5] = 0.07315;//商贷 1～5年 7.315%
        RATE[27][1][10] = 0.0748;//商贷 5-30年 7.48%
        RATE[27][2][5] = 0.0420;//公积金 1～5年 4.2%
        RATE[27][2][10] = 0.0470;//公积金 5-30年 4.7%
        //12年7月6日基准利率
        RATE[28] = new double[3][];
        RATE[28][1] = new double[11];
        RATE[28][2] = new double[11];
        RATE[28][1][5] = 0.0640;//商贷 1～5年 6.4%
        RATE[28][1][10] = 0.0655;//商贷 5-30年 6.55%
        RATE[28][2][5] = 0.0400;//公积金 1～5年 4%
        RATE[28][2][10] = 0.0450;//公积金 5-30年 4.5%
        //12年7月6日利率下限（7折）
        RATE[29] = new double[3][];
        RATE[29][1] = new double[11];
        RATE[29][2] = new double[11];
        RATE[29][1][5] = 0.0448;//商贷 1～5年 4.48%
        RATE[29][1][10] = 0.04585;//商贷 5-30年 4.585%
        RATE[29][2][5] = 0.0400;//公积金 1～5年 4%
        RATE[29][2][10] = 0.0450;//公积金 5-30年 4.5%
        //12年7月6日利率下限（85折）
        RATE[30] = new double[3][];
        RATE[30][1] = new double[11];
        RATE[30][2] = new double[11];
        RATE[30][1][5] = 0.0544;//商贷 1～5年 5.44%
        RATE[30][1][10] = 0.055675;//商贷 5-30年 5.5675%
        RATE[30][2][5] = 0.0400;//公积金 1～5年 4%
        RATE[30][2][10] = 0.0450;//公积金 5-30年 4.5%
        //12年7月6日利率上限（1.1倍）
        RATE[31] = new double[3][];
        RATE[31][1] = new double[11];
        RATE[31][2] = new double[11];
        RATE[31][1][5] = 0.0704;//商贷 1～5年 7.04%
        RATE[31][1][10] = 0.07205;//商贷 5-30年 7.205%
        RATE[31][2][5] = 0.0400;//公积金 1～5年 4%
        RATE[31][2][10] = 0.0450;//公积金 5-30年 4.5%
    }

    //得到利率
    public static double getBankRate(int lilv_type, int type, int years) {
        if (years <= 5) {
            return RATE[lilv_type][type][5];
        } else {
            return RATE[lilv_type][type][10];
        }
    }
}
